W8D1/reddit/app/controllers/posts_controller.rb

    def create
        @post = current_user.posts.new(post_params)
        if @post.save
            redirect_to post_url(@post)
        else
            flash.now[:errors] = @post.errors.full_messages
            @subs = Sub.all
---
INSERT INTO "posts" ("title", "url", "content", "sub_id", "author_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["title", "AAoaeuaoeu"], ["url", "aoeuao"], ["content", "oeuaoeiaoei"], ["sub_id", 2], ["author_id", 9], ["created_at", "2020-10-19 21:19:43.245856"], ["updated_at", "2020-10-19 21:19:43.245856"]]
SELECT "subs".* FROM "subs"