W8D1/reddit/app/controllers/subs_controller.rb

INSERT INTO "subs" ("title", "description", "moderator_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "AA"], ["description", "app academy"], ["moderator_id", 9], ["created_at", "2020-10-19 20:47:05.667938"], ["updated_at", "2020-10-19 20:47:05.667938"]]
---
    def create
        @sub = current_user.subs.new(sub_params)
        if @sub.save

SELECT "posts".* FROM "posts" INNER JOIN "post_subs" ON "posts"."id" = "post_subs"."post_id" WHERE "post_subs"."sub_id" = $1  [["sub_id", 3]]
SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "post_subs".* FROM "post_subs" WHERE "post_subs"."sub_id" = $1  [["sub_id", 2]]
---
    def show
        @sub = Sub.includes(:posts).find(params[:id])