W7D2/music_app/app/views/bands/index.html.erb

SELECT "bands".* FROM "bands"
---
<ul>
<%Band.all.each do |band|%>