W7D2/music_app/app/controllers/albums_controller.rb

    def create
        album = Album.new(album_params)
        if album.save
---
INSERT INTO "albums" ("band_id", "title", "year", "live", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["band_id", 4], ["title", "Welcome To The"], ["year", 3000], ["live", true], ["created_at", "2020-10-13 19:37:56.660598"], ["updated_at", "2020-10-13 19:37:56.660598"]]

    def update
        @album = Album.find_by(id: params[:id])
        if @album.update(album_params)
---
SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "albums" SET "band_id" = $1, "year" = $2, "updated_at" = $3 WHERE "albums"."id" = $4  [["band_id", 3], ["year", 6], ["updated_at", "2020-10-13 19:46:27.043549"], ["id", 3]]