W6D5/nn_cats/app/controllers/cats_controller.rb

SELECT  "cats".* FROM "cats" ORDER BY "cats"."id" ASC LIMIT $1  [["LIMIT", 1]]
---
    def index
        @cats = Cat.all

SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
    def show
        @kitten = Cat.find_by(id: params[:id])

SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 101], ["LIMIT", 1]]
---
    def edit
        @kitten = Cat.find_by(id: params[:id])

INSERT INTO "cats" ("birth_date", "color", "name", "sex", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
    def create
        @kitten = Cat.new(cat_params)

        if @kitten.save

SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 101], ["LIMIT", 1]]
UPDATE "cats" SET "color" = $1, "sex" = $2, "updated_at" = $3 WHERE "cats"."id" = $4  [["color", "white"], ["sex", "M"], ["updated_at", "2020-10-09 20:43:18.716183"], ["id", 101]]
---
    def update
        @kitten = Cat.find_by(id: params[:id])
        @kitten.update(cat_params)