W11D3/bench_bnb/app/models/user.rb

    def self.find_by_credentials(username, password)
        user = User.find_by(username: username)
---
SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "test5"], ["LIMIT", 1]]

    def reset_session_token!
        self.session_token = self.generate_session_token
        self.save!
---
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "0jTnN-ZuZxO8ppHSqsNytg"], ["updated_at", "2020-11-11 20:44:44.435127"], ["id", 1]]