W8D1/reddit/app/models/user.rb

SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "oeuoaeuaoei"], ["LIMIT", 1]]
---
    def self.find_by_credentials(username, password)
        user = self.find_by(username: username)